Table of Contents
 Class DoubleExtensions
Namespace
IdeaStatiCa.BimApiLink.Utils
Assembly
IdeaStatiCa.BimApiLink.dll
public static class DoubleExtensions
Inheritance
object
DoubleExtensions
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Methods
 DegreesToRadians(double)
public static double DegreesToRadians(this double val)
Parameters
val double
Returns
double
 InchesToMeters(double)
public static double InchesToMeters(this double val)
Parameters
val double
Returns
double
 IsEqual(double, double, double)
IsEqual - Determines whether leftValue and rightValue are equal.
public static bool IsEqual(this double leftValue, double rightValue, double tolerance = 1E-10)
Parameters
leftValue double
Value on LHS of operator
rightValue double
Value on RHS of operator
tolerance double
Tolerance level for comparison
Returns
bool
Return true if leftValue and rightValue are equal. Return false otherwise
 IsGreater(double, double, double)
IsGreater - Determines whether the leftValue is greater than rightValue
public static bool IsGreater(this double leftValue, double rightValue, double tolerance = 1E-10)
Parameters
leftValue double
Value on LHS of operator
rightValue double
Value on RHS of operator
tolerance double
Tolerance level for comparison
Returns
bool
Return true if the given leftValue is greater than rightValue. Return false otherwise
 IsGreaterOrEqual(double, double, double)
IsGreaterOrEqual - Determines whether the leftValue is greater or equal to rightValue
public static bool IsGreaterOrEqual(this double leftValue, double rightValue, double tolerance = 1E-10)
Parameters
leftValue double
Value on LHS of operator
rightValue double
Value on RHS of operator
tolerance double
Tolerance level for comparison
Returns
bool
Return true if leftValue is greater than or equal to rightValue. Return false otherwise
 IsLesser(double, double, double)
IsLesser - Determines whether leftValue is lesser than rightValue
public static bool IsLesser(this double leftValue, double rightValue, double tolerance = 1E-10)
Parameters
leftValue double
Value on LHS of operator
rightValue double
Value on RHS of operator
tolerance double
Tolerance level for comparison
Returns
bool
Return true if the given leftValue is lesser than rightValue. Return false otherwise
 IsLesserOrEqual(double, double, double)
IsLesserOrEqual - Determines whether the leftValue is lesser or equal to rightValue
public static bool IsLesserOrEqual(this double leftValue, double rightValue, double tolerance = 1E-10)
Parameters
leftValue double
Value on LHS of operator
rightValue double
Value on RHS of operator
tolerance double
Tolerance level for comparison
Returns
bool
Return true if the given leftValue is lesser than or equal to rightValue. Return false otherwise
 IsZero(double, double)
Checks, if value is zero with specified tolerance.
public static bool IsZero(this double value, double tolerance = 1E-09)
Parameters
value double
The value for check.
tolerance double
The precision of check.
Returns
bool
True, if value is zero, false otherwise.
 KipsToKgPerCm2(double)
public static double KipsToKgPerCm2(this double val)
Parameters
val double
Returns
double
 KipsToMPascal(double)
public static double KipsToMPascal(this double val)
Parameters
val double
Returns
double
 KipsToNewtons(double)
public static double KipsToNewtons(this double val)
Parameters
val double
Returns
double
 MetersToInches(double)
public static double MetersToInches(this double val)
Parameters
val double
Returns
double
 MetersToMilimeters(double)
public static double MetersToMilimeters(this double val)
Parameters
val double
Returns
double
 MilimetersToMeters(double)
public static double MilimetersToMeters(this double val)
Parameters
val double
Returns
double
 PrecentageToRadians(double)
public static double PrecentageToRadians(this double val)
Parameters
val double
Returns
double
 RadiansToDegrees(double)
public static double RadiansToDegrees(this double val)
Parameters
val double
Returns
double
 Edit this page